---
title: ComponentRepeaterSlot
classe: Autodesk.Revit.DB.ComponentRepeaterSlot
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ComponentRepeaterSlot

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId FamilyType { get; set; }` | `componentRepeaterSlot.FamilyType` | ElementId |
| `Boolean IsDefault { get; }` | `componentRepeaterSlot.IsDefault` | Boolean |
| `Boolean IsEmpty { get; }` | `componentRepeaterSlot.IsEmpty` | Boolean |
| `Boolean IsTypeValidForSlot(ElementId)` | `componentRepeaterSlot.IsTypeValidForSlot(typeId)` | Boolean |
| `Void MakeDefault()` | `componentRepeaterSlot.MakeDefault()` | Void |
| `Void MakeEmpty()` | `componentRepeaterSlot.MakeEmpty()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```